In [2]:
import pandas as pd

In [3]:
# reading the csv file
df = pd.read_csv("StudentsPerformance.csv")
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Math Operations

## Operations in columns

In [4]:
# select a column and calculate total sum of the math score column
df["math score"].sum()

np.int64(66089)

In [9]:
# count, mean, std, max, and min
df["math score"].count() # count the number of the rows in the colomn
df["math score"].mean() #avrage val of the column
df["math score"].std() # standared divition
df["math score"].max() # max val 
df["math score"].min()  # min val

0

In [10]:
# easier calculation with .describe() can have all the methode of (count, mean, std, max, and min)
df["math score"].describe()

count    1000.00000
mean       66.08900
std        15.16308
min         0.00000
25%        57.00000
50%        66.00000
75%        77.00000
max       100.00000
Name: math score, dtype: float64

## Operations in rows

In [18]:
# calculating the sum in a row of math score	reading score	writing score
df["sum"]=df["math score"] + df["reading score"] + df["writing score"]
df["sum"]

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Name: sum, Length: 1000, dtype: int64

In [20]:
# calculating the average score and assigning the result to a new column
df["avg"] = (df["math score"] + df["reading score"] + df["writing score"])/3

In [21]:
# showing the dataframe
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,sum,avg
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333
2,female,group B,master's degree,standard,none,90,95,93,278,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,282,94.000000
996,male,group C,high school,free/reduced,none,62,55,55,172,57.333333
997,female,group C,high school,free/reduced,completed,59,71,65,195,65.000000
998,female,group D,some college,standard,completed,68,78,77,223,74.333333
999,female,group D,some college,free/reduced,none,77,86,86,249,83.000000